Autodesk.Revit.UI.ViewSheetSetUI.LaunchDialog(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.IntPtr)
Launches the UI managing the ViewSheetSet.
document:
Document to manage ViewSheetSet for.
defaultViewSheetSetId:
The default view sheet set id.
parentHwnd:
The hwnd of parent window for dialog
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.UI.ViewSheetSetUI.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.UI.ViewSheetSetUI
The UI on managing ViewSheetSet.